In [14]:
import pandas as pd

In [15]:
car_names = pd.Series(["Toyota", "Honda", "Toyota", "BMW", "Nissan", "Toyota", "Honda", "Honda", "Toyota", "Nissan"])

In [16]:
car_names

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
dtype: object

In [17]:
colours = pd.Series(["White", "Red", "Blue", "Black", "White", "Green", "Blue", "Blue", "White", "WHite"])

In [18]:
colours

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    WHite
dtype: object

In [19]:
Odometer_KM = pd.Series(["200043", "97899", "43549", "12179", "223095", "103213", "50698", "64738", "71000", "42600"])

In [20]:
Odometer_KM

0    200043
1     97899
2     43549
3     12179
4    223095
5    103213
6     50698
7     64738
8     71000
9     42600
dtype: object

In [21]:
Doors = pd.Series(["4", "4", "3", "5", "4", "4", "4", "4", "4", "4"])

In [22]:
Doors

0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
dtype: object

In [23]:
Price = pd.Series(["$5,000.00", "$6,000.00", "$8,000.00","$23,000.00", "$4,500.00", "$5,000.00", "$8,500.00","$8,000.00", "$7,250.00", "$10,200.00"])

In [24]:
Price

0     $5,000.00
1     $6,000.00
2     $8,000.00
3    $23,000.00
4     $4,500.00
5     $5,000.00
6     $8,500.00
7     $8,000.00
8     $7,250.00
9    $10,200.00
dtype: object

In [25]:
new_work = pd.DataFrame({"car_names": car_names, "colours": colours, "Odometer_Km": Odometer_KM, "Doors": Doors, "Price": Price,})

In [26]:
new_work

  car_names colours Odometer_Km Doors       Price
0    Toyota   White      200043     4   $5,000.00
1     Honda     Red       97899     4   $6,000.00
2    Toyota    Blue       43549     3   $8,000.00
3       BMW   Black       12179     5  $23,000.00
4    Nissan   White      223095     4   $4,500.00
5    Toyota   Green      103213     4   $5,000.00
6     Honda    Blue       50698     4   $8,500.00
7     Honda    Blue       64738     4   $8,000.00
8    Toyota   White       71000     4   $7,250.00
9    Nissan   WHite       42600     4  $10,200.00

In [27]:
new_work.to_csv("new_work.csv")

In [29]:
new_work = pd.read_csv("new_work.csv")

In [30]:
new_work

   Unnamed: 0 car_names colours  Odometer_Km  Doors       Price
0           0    Toyota   White       200043      4   $5,000.00
1           1     Honda     Red        97899      4   $6,000.00
2           2    Toyota    Blue        43549      3   $8,000.00
3           3       BMW   Black        12179      5  $23,000.00
4           4    Nissan   White       223095      4   $4,500.00
5           5    Toyota   Green       103213      4   $5,000.00
6           6     Honda    Blue        50698      4   $8,500.00
7           7     Honda    Blue        64738      4   $8,000.00
8           8    Toyota   White        71000      4   $7,250.00
9           9    Nissan   WHite        42600      4  $10,200.00

In [33]:
new_work["Price"].sum()

'$5,000.00$6,000.00$8,000.00$23,000.00$4,500.00$5,000.00$8,500.00$8,000.00$7,250.00$10,200.00'

In [34]:
new_work.loc[:, "Price"]

0     $5,000.00
1     $6,000.00
2     $8,000.00
3    $23,000.00
4     $4,500.00
5     $5,000.00
6     $8,500.00
7     $8,000.00
8     $7,250.00
9    $10,200.00
Name: Price, dtype: object

In [37]:
new_work['Price'] = (
    new_work['Price']
    .astype(str)  # Convert all values to strings
    .str.replace(r'[^\d\.]', '', regex=True)  # Remove everything except digits and decimal points
    .astype(float)  # Convert to floats
)

In [38]:
new_work['Price']

0     5000.0
1     6000.0
2     8000.0
3    23000.0
4     4500.0
5     5000.0
6     8500.0
7     8000.0
8     7250.0
9    10200.0
Name: Price, dtype: float64